       IDENTIFICATION DIVISION.
       PROGRAM-ID.    EM01EX04.
       AUTHOR.        CRISTIANE CARMO.
       INSTALLATION.  HOME.
       DATE-WRITTEN.  10-03-2022.
       DATE-COMPILED.
       SECURITY.      APENAS O AUTOR PODE MODIFICA-LO.
      *REMARKS.       LE OS REGITROS DO ARQUIVO DE ENTRADA CADCLI1
      *               E GRAVA APENAS OS REGISTROS DO SEXO MASCULINO
      *               NO ARQUIVO DE SAIDA CADCLI2.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
           SOURCE-COMPUTER.  DELL-PC.
           OBJECT-COMPUTER.  DELL-PC.
           SPECIAL-NAMES.    DECIMAL-POINT IS COMMA.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT CADCLI1 ASSIGN TO DISK
           ORGANIZATION IS LINE SEQUENTIAL.
           SELECT CADCLI2 ASSIGN TO DISK
           ORGANIZATION IS LINE SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.

       FD CADCLI1
           LABEL RECORD ARE STANDARD
           VALUE OF FILE-ID IS "CADCLI1.DAT".
       01 REG-ENT.
           02 COD-ENT   PIC 9(05).
           02 NOME-ENT  PIC X(20).
           02 SEXO-ENT  PIC X(01).

       FD CADCLI2
           LABEL RECORD ARE STANDARD
           VALUE OF FILE-ID IS "CADCLI2.DAT".
       01 REG-SAI.
           02 COD-SAI   PIC 9(05).
           02 NOME-SAI  PIC X(20).

       WORKING-STORAGE SECTION.
       77 FIM-ARQ       PIC X(03) VALUE "NAO".

       PROCEDURE DIVISION.
       MAIN-EM01EX04.
           PERFORM INICIO.
           PERFORM PRINCIPAL UNTIL FIM-ARQ EQUAL "SIM".
           PERFORM TERMINO.
           STOP RUN.

       INICIO.
           OPEN INPUT  CADCLI1
                OUTPUT CADCLI2.
           PERFORM LEITURA.

       LEITURA.
           READ CADCLI1 AT END MOVE "SIM" TO FIM-ARQ.

       PRINCIPAL.
           PERFORM CONDICAO.
           PERFORM LEITURA.

       CONDICAO.
           IF SEXO-ENT EQUAL "M" OR "m"
                 PERFORM GRAVACAO.

       GRAVACAO.
           MOVE COD-ENT TO COD-SAI.
           MOVE NOME-ENT TO NOME-SAI.
           WRITE REG-SAI.

       TERMINO.
           CLOSE CADCLI1
                 CADCLI2.
