       IDENTIFICATION DIVISION.
       PROGRAM-ID.    EM01EX06.
       AUTHOR.        CRISTIANE CARMO.
       INSTALLATION.  HOME.
       DATE-WRITTEN.  02-04-2022.
       DATE-COMPILED.
       SECURITY.      APENAS O AUTOR PODE MODIFICA-LO.
      *REMARKS.       LE OS REGISTROS DO ARQUIVO DE ENTRADA CADENT
      *               E GRAVA NO ARQUIVO DE SAIDA CADSAI OS REGISTROS
      *               QUE POSSUEM SALARIO MAIOR QUE 3000.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
           SOURCE-COMPUTER. DELL-PC.
           OBJECT-COMPUTER. DELL-PC.
           SPECIAL-NAMES.   DECIMAL-POINT IS COMMA.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT CADENT ASSIGN TO DISK
           ORGANIZATION IS LINE SEQUENTIAL.
           SELECT CADSAI ASSIGN TO DISK
           ORGANIZATION IS LINE SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.
       FD CADENT
           LABEL RECORD ARE STANDARD
           VALUE OF FILE-ID IS "CADENT.DAT".
       01 REG-ENT.
           02 MATRICULA-ENT  PIC 9(05).
           02 NOME-ENT       PIC X(30).
           02 SALARIO-ENT    PIC 9(05)V99.

       FD CADSAI
           LABEL RECORD ARE STANDARD
           VALUE OF FILE-ID IS "CADSAI.DAT".
       01 REG-SAI.
           02 MATRICULA-SAI  PIC 9(05).
           02 NOME-SAI       PIC X(30).
           02 SALARIO-SAI    PIC 9(05)V99.

       WORKING-STORAGE SECTION.
       77 FIM-ARQ            PIC X(03) VALUE "NAO".

       PROCEDURE DIVISION.
       MAIN-EM01EX06.
           PERFORM INICIO.
           PERFORM PRINCIPAL UNTIL FIM-ARQ EQUAL "SIM".
           PERFORM TERMINO.
           STOP RUN.

       INICIO.
           OPEN INPUT CADENT
                OUTPUT CADSAI.
           PERFORM LEITURA.

       LEITURA.
           READ CADENT AT END MOVE "SIM" TO FIM-ARQ.

       PRINCIPAL.
           PERFORM CONDICAO.
           PERFORM LEITURA.

       CONDICAO.
           IF SALARIO-ENT > 3000 THEN
               PERFORM GRAVACAO.

       GRAVACAO.
           MOVE MATRICULA-ENT TO MATRICULA-SAI.
           MOVE NOME-ENT TO NOME-SAI.
           MOVE SALARIO-ENT TO SALARIO-SAI.
           WRITE REG-SAI.

       TERMINO.
           CLOSE CADENT
                 CADSAI.
       
